Repository: luismmejiasb/ArtistSearch
Catalog: ArtistSearch/*.lproj/Localizable.strings
Languages: es

# unknown_error
source: An unknown error has occurred, please try later.
es: Ha ocurrido un error desconocido, por favor intente más tarde.

# operation_canceled
source: The operation has been canceled, please try later.
es: La operación ha sido cancelada, por favor intente más tarde.

# bad_url
source: We have problems with our service, please try later.
es: Tenemos problemas con nuestro servicio, por favor intente más tarde

# timed_out
source: The time of the operation has run out, please check your internet connection and try later.
es: El tiempo de la operación se ha agotado, verifique su conexión a Internet e intente más tarde.

# service_url_unsupported
source: We have problems with our service, please try later.
es: Tenemos problemas con nuestro servicio, por favor intente más tarde

# problem_with_host
source: We have problems with our service, please try later.
es: Tenemos problemas con nuestro servicio, por favor intente más tarde

# connection_lost
source: Connection with lost server. Please try again.
es: Conexión con el servidor perdido. Por favor, inténtalo de nuevo

# problems_with_service
source: We have problems with our service, please try later.
es: Tenemos problemas con nuestro servicio, por favor intente más tarde

# too_many_redirects
source: Please try later
es: Por favor intente mas tarde

# resource_not_available
source: We have problems with our service, please try later.
es: Tenemos problemas con nuestro servicio, por favor intente más tarde

# offline
source: Please check your internet connection and try again.
es: Por favor, compruebe su conexión a Internet y vuelva a intentarlo.

# server_problem
source: The server had a problem with your response, please try later.
es: El servidor tuvo un problema con su respuesta, inténtelo más tarde.

# authentication
source: You must log in to use the service.
es: Debe iniciar sesión para utilizar el servicio.

# no_information
source: The server had an empty response.
es: El servidor tuvo una respuesta vacía.

# security_error
source: The service does not have the necessary security to work.
es: El servicio no tiene la seguridad necesaria para trabajar.

# non-existent_service
source: The service no longer exists.
es: El servicio ya no existe.

# very_large_response
source: The server responded with a very large response, try again later
es: El servidor respondió con una respuesta muy grande, inténtalo de nuevo más tarde

# unkown_error
source: An unknown error has occurred. Please, try later.
es: Ha ocurrido un error desconocido. Por favor, intente más tarde.

# generic_error
source: Something went wrong
es: Algo salió mal

# generic_error_title
source: Something went wrong
es: Algo salió mal

# search_artist_default_information
source: All set, now you can start looking for your favorite artists
es: Todo listo, ahora puedes comenzar a buscar a tus artistas favoritos

# search_artist_nothing_found_information
source: Oops. No results for the current search. Try with other artist
es: Uups. No hay resultados para la búsqueda actual. Prueba con otro artista

# cancel_button_title
source: Cancel
es: Cancelar

# search_bar_placeholder_text
source: Search an artist
es: Buscar un artista

# unmark_favorite_success_message
source: Artist unmarked as favorite correctly
es: Artista desmarcado como favorito correctamente

# unmark_favorite_failure_message
source: There was an error trying to unmark artist as favorite. Plese try again later
es: Se produjo un error al intentar desmarcar al artista como favorito. Por favor, inténtelo de nuevo más tarde

# mark_favorite_success_message
source: Artist marked as favorite correctly
es: Artista marcado como favorito correctamente

# mark_favorite_failure_message
source: There was an error trying to mark artist as favorite. Plese try again later
es: Se produjo un error al intentar marcar al artista como favorito. Por favor, inténtalo de nuevo más tarde

# favorite_artist_alert_title
source: Hey there
es: Hola Hola!

# favorite_artist_alert_message
source: Seems like you really like %@ 😄
es: Parece que realmente te gusta %@ 😄

# favorite_artist_alert_message_conecting
source: that artist
es: ese artista

# no_favorite_artist_message
source: No favorite artist marked yet
es: Ningún artista favorito marcado aún

# mark_favorite_artist_button_title
source: Mark as favorite
es: Marcar como favorito

# unmark_favorite_artist_button_title
source: Unmark as favorite
es: Desmarcar como favorito

# success_action_title
source: Success
es: Éxito

# failure_action_title
source: Failure
es: Error
